package com.mzj.mohome.util;


import java.io.UnsupportedEncodingException;
import java.util.Random;

public class RandomUtil {

    /**
     * min 最小获取的随机数，
     * 最大获取的随机数max:min+num+1
     * @param min
     * @param num
     * @return
     */
    public static int getRandomMinAndMax(int min,int num){
        Random random = new Random();
        return (min + Math.abs(random.nextInt(num))); // 获取高位值
    }

    /**方法1*/
    public static String getRandomJianHan(int len) {
        String randomName = "";
        for (int i = 0; i < len; i++) {
            String str = null;
            int hightPos, lowPos; // 定义高低位
            Random random = new Random();
            hightPos = (176 + Math.abs(random.nextInt(39))); // 获取高位值
            lowPos = (161 + Math.abs(random.nextInt(93))); // 获取低位值
            byte[] b = new byte[2];
            b[0] = (new Integer(hightPos).byteValue());
            b[1] = (new Integer(lowPos).byteValue());
            try {
                str = new String(b, "GBK"); // 转成中文
            } catch (UnsupportedEncodingException ex) {
                ex.printStackTrace();
            }
            randomName += str;
        }
        return randomName;
    }
    public static String randomName(boolean simple, int len) {
        String surName[] = {
                "赵","钱","孙","李","周","吴","郑","王","冯","陈","楮","卫","蒋","沈","韩","杨",
                "朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",
                "戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",
                "鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",
                "费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常",
                "乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄",
                "和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧",
                "计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",
                "杜","阮","蓝","闽","席","季","麻","强","贾","路","娄","危","江","童","颜","郭",
                "梅","盛","林","刁","锺","徐","丘","骆","高","夏","蔡","田","樊","胡","凌","霍",
                "虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗",
                "丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚",
                "程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","麹","家","封",
                "芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓",
                "牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫",
                "宁","仇","栾","暴","甘","斜","厉","戎","祖","武","符","刘","景","詹","束","龙",
                "叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂",
                "索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁","胥","能","苍","双",
                "闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍",
                "郤","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农",
                "温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容",
                "向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘",
                "匡","国","文","寇","广","禄","阙","东","欧","殳","沃","利","蔚","越","夔","隆",
                "师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空",
                "曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红",
                "游","竺","权","逑","盖","益","桓","公","晋","楚","阎","法","汝","鄢","涂","钦",
                "岳","帅","缑","亢","况","后","有","琴","商","牟","佘","佴","伯","赏","墨","哈",
                "谯","笪","年","爱","阳","佟"};
        String doubleSurName[] = {"万俟","司马","上官","欧阳","夏侯","诸葛","闻人","东方",
                "赫连","皇甫","尉迟","公羊","澹台","公冶","宗政","濮阳","淳于","单于","太叔","申屠",
                "公孙","仲孙","轩辕","令狐","锺离","宇文","长孙","慕容","鲜于","闾丘","司徒","司空",
                "丌官","司寇","仉","督","子车","颛孙","端木","巫马","公西","漆雕","乐正","壤驷","公良",
                "拓拔","夹谷","宰父","谷梁","段干","百里","东郭","南门","呼延","归","海","羊舌","微生",
                "梁丘","左丘","东门","西门","南宫"};

        String[] word = {"一","乙","二","十","丁","厂","七","卜","人","入","八","九","几","儿","了","力","乃","刀","又",
                "三","于","干","亏","士","工","土","才","寸","下","大","丈","与","万","上","小","口","巾","山",
                "千","乞","川","亿","个","勺","久","凡","及","夕","丸","么","广","亡","门","义","之","尸","弓",
                "己","已","子","卫","也","女","飞","刃","习","叉","马","乡","丰","王","井","开","夫","天","无",
                "元","专","云","扎","艺","木","五","支","厅","不","太","犬","区","历","尤","友","匹","车","巨",
                "牙","屯","比","互","切","瓦","止","少","日","中","冈","贝","内","水","见","午","牛","手","毛",
                "气","升","长","仁","什","片","仆","化","仇","币","仍","仅","斤","爪","反","介","父","从","今",
                "凶","分","乏","公","仓","月","氏","勿","欠","风","丹","匀","乌","凤","勾","文","六","方","火",
                "为","斗","忆","订","计","户","认","心","尺","引","丑","巴","孔","队","办","以","允","予","劝",
                "双","书","幻","玉","刊","示","末","未","击","打","巧","正","扑","扒","功","扔","去","甘","世",
                "古","节","本","术","可","丙","左","厉","右","石","布","龙","平","灭","轧","东","卡","北","占",
                "业","旧","帅","归","且","旦","目","叶","甲","申","叮","电","号","田","由","史","只","央","兄",
                "叼","叫","另","叨","叹","四","生","失","禾","丘","付","仗","代","仙","们","仪","白","仔","他",
                "斥","瓜","乎","丛","令","用","甩","印","乐","句","匆","册","犯","外","处","冬","鸟","务","包",
                "饥","主","市","立","闪","兰","半","汁","汇","头","汉","宁","穴","它","讨","写","让","礼","训",
                "必","议","讯","记","永","司","尼","民","出","辽","额","奴","加","召","皮","边","发","孕","圣",
                "对","台","矛","纠","母","幼","丝","式","刑","动","扛","寺","吉","扣","考","托","老","执","巩",
                "圾","扩","扫","地","扬","场","耳","共","芒","亚","芝","朽","朴","机","权","过","臣","再","协",
                "西","压","厌","在","有","百","存","而","页","匠","夸","夺","灰","达","列","死","成","夹","轨",
                "邪","划","迈","毕","至","此","贞","师","尘","尖","劣","光","当","早","吐","吓","虫","曲","团",
                "同","吊","吃","因","吸","吗","屿","帆","岁","回","岂","刚","则","肉","网","年","朱","先","丢",
                "舌","竹","迁","乔","伟","传","乒","乓","休","伍","伏","优","伐","延","件","任","伤","价","份",
                "华","仰","仿","伙","伪","自","血","向","似","后","行","舟","全","会","杀","合","兆","企","众",
                "爷","伞","创","肌","朵","杂","危","旬","旨","负","各","名","多","争","色","壮","冲","冰","庄",
                "庆","亦","刘","齐","交","次","衣","产","决","充","妄","闭","问","闯","羊","并","关","米","灯",
                "州","汗","污","江","池","汤","忙","兴","宇","守","宅","字","安","讲","军","许","论","农","讽",
                "设","访","寻","那","迅","尽","导","异","孙","阵","阳","收","阶","阴","防","奸","如","妇","好",
                "她","吖","戏","羽","观","欢","买","红","纤","级","约","纪","驰","巡","寿","弄","麦","形","进",
                "戒","吞","远","违","运","扶","抚","坛","技","坏","扰","拒","找","批","扯","址","走","抄","坝",
                "贡","攻","赤","折","抓","扮","抢","孝","均","抛","投","坟","抗","坑","坊","抖","护","壳","志",
                "扭","块","声","把","报","却","劫","芽","花","芹","芬","苍","芳","严","芦","劳","克","苏","杆",
                "杠","杜","材","村","杏","极","李","杨","求","更","束","豆","两","丽","医","辰","励","否","还",
                "歼","来","连","步","坚","旱","盯","呈","时","吴","助","县","里","呆","园","旷","围","呀","吨",
                "足","邮","男","困","吵","串","员","听","吩","吹","呜","吧","吼","别","岗","帐","财","针","钉",
                "告","我","乱","利","秃","秀","私","每","兵","估","体","何","但","伸","作","伯","伶","佣","低",
                "你","住","位","伴","身","皂","佛","近","彻","役","返","余","希","坐","谷","妥","含","邻","岔",
                "肝","肚","肠","龟","免","狂","犹","角","删","条","卵","岛","迎","饭","饮","系","言","冻","状",
                "亩","况","床","库","疗","应","冷","这","序","辛","弃","冶","忘","闲","间","闷","判","灶","灿",
                "弟","汪","沙","汽","沃","泛","沟","没","沈","沉","怀","忧","快","完","宋","宏","牢","究","穷",
                "灾","良","证","启","评","补","初","社","识","诉","诊","词","译","君","灵","即","层","尿","尾",
                "迟","局","改","张","忌","际","陆","阿","陈","阻","附","妙","妖","妨","努","忍","劲","鸡","驱",
                "纯","纱","纳","纲","驳","纵","纷","纸","纹","纺","驴","纽","奉","玩","环","武","青","责","现",
                "表","规","抹","拢","拔","拣","担","坦","押","抽","拐","拖","拍","者","顶","拆","拥","抵","拘",
                "势","抱","垃","拉","拦","拌","幸","招","坡","披","拨","择","抬","其","取","苦","若","茂","苹",
                "苗","英","范","直","茄","茎","茅","林","枝","杯","柜","析","板","松","枪","构","杰","述","枕",
                "丧","或","画","卧","事","刺","枣","雨","卖","矿","码","厕","奔","奇","奋","态","欧","垄","妻",
                "轰","顷","转","斩","轮","软","到","非","叔","肯","齿","些","虎","虏","肾","贤","尚","旺","具",
                "果","味","昆","国","昌","畅","明","易","昂","典","固","忠","咐","呼","鸣","咏","呢","岸","岩",
                "帖","罗","帜","岭","凯","败","贩","购","图","钓","制","知","垂","牧","物","乖","刮","秆","和",
                "季","委","佳","侍","供","使","例","版","侄","侦","侧","凭","侨","佩","货","依","的","迫","质",
                "欣","征","往","爬","彼","径","所","舍","金","命","斧","爸","采","受","乳","贪","念","贫","肤",
                "肺","肢","肿","胀","朋","股","肥","服","胁","周","昏","鱼","兔","狐","忽","狗","备","饰","饱",
                "饲","变","京","享","店","夜","庙","府","底","剂","郊","废","净","盲","放","刻","育","闸","闹",
                "郑","券","卷","单","炒","炊","炕","炎","炉","沫","浅","法","泄","河","沾","泪","油","泊","沿",
                "泡","注","泻","泳","泥","沸","波","泼","泽","治","怖","性","怕","怜","怪","学","宝","宗","定",
                "宜","审","宙","官","空","帘","实","试","郎","诗","肩","房","诚","衬","衫","视","话","诞","询",
                "该","详","建","肃","录","隶","居","届","刷","屈","弦","承","孟","孤","陕","降","限","妹","姑",
                "姐","姓","始","驾","参","艰","线","练","组","细","驶","织","终","驻","驼","绍","经","贯","奏",
                "春","帮","珍","玻","毒","型","挂","封","持","项","垮","挎","城","挠","政","赴","赵","挡","挺",
                "括","拴","拾","挑","指","垫","挣","挤","拼","挖","按","挥","挪","某","甚","革","荐","巷","带",
                "草","茧","茶","荒","茫","荡","荣","故","胡","南","药","标","枯","柄","栋","相","查","柏","柳",
                "柱","柿","栏","树","要","咸","威","歪","研","砖","厘","厚","砌","砍","面","耐","耍","牵","残",
                "殃","轻","鸦","皆","背","战","点","临","览","竖","省","削","尝","是","盼","眨","哄","显","哑",
                "冒","映","星","昨","畏","趴","胃","贵","界","虹","虾","蚁","思","蚂","虽","品","咽","骂","哗",
                "咱","响","哈","咬","咳","哪","炭","峡","罚","贱","贴","骨","钞","钟","钢","钥","钩","卸","缸",
                "拜","看","矩","怎","牲","选","适","秒","香","种","秋","科","重","复","竿","段","便","俩","贷",
                "顺","修","保","促","侮","俭","俗","俘","信","皇","泉","鬼","侵","追","俊","盾","待","律","很",
                "须","叙","剑","逃","食","盆","胆","胜","胞","胖","脉","勉","狭","狮","独","狡","狱","狠","贸",
                "怨","急","饶","蚀","饺","饼","弯","将","奖","哀","亭","亮","度","迹","庭","疮","疯","疫","疤",
                "姿","亲","音","帝","施","闻","阀","阁","差","养","美","姜","叛","送","类","迷","前","首","逆",
                "总","炼","炸","炮","烂","剃","洁","洪","洒","浇","浊","洞","测","洗","活","派","洽","染","济",
                "洋","洲","浑","浓","津","恒","恢","恰","恼","恨","举","觉","宣","室","宫","宪","突","穿","窃",
                "客","冠","语","扁","袄","祖","神","祝","误","诱","说","诵","垦","退","既","屋","昼","费","陡",
                "眉","孩","除","险","院","娃","票","藕","姻","娇","怒","架","贺","盈","勇","怠","柔","垒","绑",
                "绒","结","绕","骄","绘","给","络","骆","绝","绞","统","耕","耗","艳","泰","珠","班","素","蚕",
                "顽","盏","匪","捞","栽","捕","振","载","赶","起","盐","捎","捏","埋","捉","捆","捐","损","都",
                "哲","逝","捡","换","挽","热","恐","壶","挨","耻","耽","恭","莲","莫","荷","获","晋","恶","真",
                "框","桂","档","桐","株","桥","桃","格","校","核","样","根","索","哥","速","逗","栗","配","翅",
                "辱","唇","夏","础","破","原","套","逐","烈","殊","顾","轿","较","顿","毙","致","柴","桌","虑",
                "监","紧","党","晒","眠","晓","鸭","晃","晌","晕","蚊","哨","哭","恩","唤","啊","唉","罢","峰",
                "圆","贼","贿","钱","钳","钻","铁","铃","铅","缺","氧","特","牺","造","乘","敌","秤","租","积",
                "秧","秩","称","秘","透","笔","笑","笋","债","借","值","倚","倾","倒","倘","俱","倡","候","俯",
                "倍","倦","健","臭","射","躬","息","徒","徐","舰","舱","般","航","途","拿","噢","爱","颂","翁",
                "脆","脂","胸","胳","脏","胶","脑","狸","狼","逢","留","皱","饿","恋","桨","浆","衰","高","席",
                "准","座","脊","症","病","疾","疼","疲","效","离","唐","资","凉","站","剖","竞","部","旁","旅",
                "畜","阅","羞","瓶","拳","粉","料","益","兼","烤","烘","烦","烧","烛","烟","递","涛","浙","涝",
                "酒","涉","消","浩","海","涂","浴","浮","流","润","浪","浸","涨","烫","涌","悟","悄","悔","悦",
                "害","宽","家","宵","宴","宾","窄","容","宰","案","请","朗","诸","读","扇","袜","袖","袍","被",
                "祥","课","谁","调","冤","谅","谈","谊","剥","恳","展","剧","屑","弱","陵","陶","陷","陪","娱",
                "娘","通","能","难","预","桑","绢","绣","验","继","球","理","捧","堵","描","域","掩","捷","排",
                "掉","堆","推","掀","授","教","掏","掠","培","接","控","探","据","掘","职","基","著","勒","黄",
                "萌","萝","菌","菜","萄","菊","萍","菠","营","械","梦","梢","梅","检","梳","梯","桶","救","副",
                "票","戚","爽","聋","袭","盛","雪","辅","辆","虚","雀","堂","常","匙","晨","睁","眯","眼","悬",
                "野","啦","晚","啄","距","跃","略","蛇","累","唱","患","唯","崖","崭","崇","圈","铜","铲","银",
                "甜","梨","犁","移","笨","笼","笛","符","第","敏","做","袋","悠","偿","偶","偷","您","售","停",
                "偏","假","得","衔","盘","船","斜","盒","鸽","悉","欲","彩","领","脚","脖","脸","脱","象","够",
                "猜","猪","猎","猫","猛","馅","馆","凑","减","毫","麻","痒","痕","廊","康","庸","鹿","盗","章",
                "竟","商","族","旋","望","率","着","盖","粘","粗","粒","断","剪","兽","清","添","淋","淹","渠",
                "渐","混","渔","淘","液","淡","深","婆","梁","渗","情","惜","惭","悼","惧","惕","惊","惨","惯",
                "寇","寄","宿","窑","密","谋","谎","祸","谜","逮","敢","屠","弹","随","蛋","隆","隐","婚","婶",
                "颈","绩","绪","续","骑","绳","维","绵","绸","绿","琴","斑","替","款","堪","搭","塔","越","趁",
                "趋","超","提","堤","博","揭","喜","插","揪","搜","煮","援","裁","搁","搂","搅","握","揉","斯",
                "期","欺","联","散","惹","葬","葛","董","葡","敬","葱","落","朝","辜","葵","棒","棋","植","森",
                "椅","椒","棵","棍","棉","棚","棕","惠","惑","逼","厨","厦","硬","确","雁","殖","裂","雄","暂",
                "雅","辈","悲","紫","辉","敞","赏","掌","晴","暑","最","量","喷","晶","喇","遇","喊","景","践",
                "跌","跑","遗","蛙","蛛","蜓","喝","喂","喘","喉","幅","帽","赌","赔","黑","铸","铺","链","销",
                "锁","锄","锅","锈","锋","锐","短","智","毯","鹅","剩","稍","程","稀","税","筐","等","筑","策",
                "筛","筒","答","筋","筝","傲","傅","牌","堡","集","焦","傍","储","奥","街","惩","御","循","艇",
                "舒","番","释","禽","腊","脾","腔","鲁","猾","猴","然","馋","装","蛮","就","痛","童","阔","善",
                "羡","普","粪","尊","道","曾","焰","港","湖","渣","湿","温","渴","滑","湾","渡","游","滋","溉",
                "愤","慌","惰","愧","愉","慨","割","寒","富","窜","窝","窗","遍","裕","裤","裙","谢","谣","谦",
                "属","屡","强","粥","疏","隔","隙","絮","嫂","登","缎","缓","编","骗","缘","瑞","魂","肆","摄",
                "摸","填","搏","塌","鼓","摆","携","搬","摇","搞","塘","摊","蒜","勤","鹊","蓝","墓","幕","蓬",
                "蓄","蒙","蒸","献","禁","楚","想","槐","榆","楼","概","赖","酬","感","碍","碑","碎","碰","碗",
                "碌","雷","零","雾","雹","输","督","龄","鉴","睛","睡","睬","鄙","愚","暖","盟","歇","暗","照",
                "跨","跳","跪","路","跟","遣","蛾","蜂","嗓","置","罪","罩","错","锡","锣","锤","锦","键","锯",
                "矮","辞","稠","愁","筹","签","简","毁","舅","鼠","催","傻","像","躲","微","愈","遥","腰","腥",
                "腹","腾","腿","触","解","酱","痰","廉","新","韵","意","粮","数","煎","塑","慈","煤","煌","满",
                "漠","源","滤","滥","滔","溪","溜","滚","滨","粱","滩","慎","誉","塞","谨","福","群","殿","辟",
                "障","嫌","嫁","叠","缝","缠","静","碧","璃","墙","撇","嘉","摧","截","誓","境","摘","摔","聚",
                "蔽","慕","暮","蔑","模","榴","榜","榨","歌","遭","酷","酿","酸","磁","愿","需","弊","裳","颗",
                "嗽","蜻","蜡","蝇","蜘","赚","锹","锻","舞","稳","算","箩","管","僚","鼻","魄","貌","膜","膊",
                "膀","鲜","疑","馒","裹","敲","豪","膏","遮","腐","瘦","辣","竭","端","旗","精","歉","熄","熔",
                "漆","漂","漫","滴","演","漏","慢","寨","赛","察","蜜","谱","嫩","翠","熊","凳","骡","缩","慧",
                "撕","撒","趣","趟","撑","播","撞","撤","增","聪","鞋","蕉","蔬","横","槽","樱","橡","飘","醋",
                "醉","震","霉","瞒","题","暴","瞎","影","踢","踏","踩","踪","蝶","蝴","嘱","墨","镇","靠","稻",
                "黎","稿","稼","箱","箭","篇","僵","躺","僻","德","艘","膝","膛","熟","摩","颜","毅","糊","遵",
                "潜","潮","懂","揣","慰","劈","操","燕","薯","薪","薄","颠","橘","整","融","醒","餐","嘴","蹄",
                "器","赠","默","镜","赞","篮","邀","衡","膨","雕","磨","凝","辨","辩","糖","糕","燃","澡","激",
                "懒","壁","避","缴","戴","擦","鞠","藏","霜","霞","瞧","蹈","螺","穗","繁","辫","赢","糟","糠",
                "燥","臂","翼","骤","鞭","覆","蹦","镰","翻","鹰","警","攀","蹲","颤","瓣","爆","疆","壤","耀",
                "躁","嚼","嚷","籍","魔","灌","蠢","霸","露","囊","罐"};

        String[] wordTree = {"飞狐外传","雪山飞狐","连城决","天龙八部","射雕英雄传","白马啸西风","鹿鼎记","笑傲江湖",
                "书剑恩仇录","神雕侠侣","侠客行","倚天屠龙记","碧血剑","鸳鸯刀","越女剑","于管家","田青文","左书僮","右书僮",
                "平阿四","阮士忠","刘元鹤","杜希孟","周云阳","郑三娘","宝树","苗若兰","苗人凤","范帮主","殷吉","胡一刀","胡斐",
                "陶子安","陶百岁","曹云奇","熊元献","静智大师","赛总管","卜垣","丁典","万震山","马大鸣","万圭","水福","水福","水笙",
                "孙均","冯坦","平工头","苗人凤","南仁通","补锅匠","脚夫","车夫","蒋调侯","店伴","钟兆文","钟兆英","钟兆能","南兰","苗若兰",
                "商老太","平四","胡斐","张总管","王剑英","王剑杰","陈禹","古若般","殷仲翔","福康安","赵半山","孙刚峰","吕小妹","钟四嫂","易吉钟小二",
                "钟阿四","胖商人","瘦商人","凤南天","凤七","俞朝奉","蛇皮张","邝宝官","凤一鸣","大汉","孙伏虎","尉迟连","杨宾","中年武师","程灵素同桌后生",
                "袁紫衣","刘鹤真","崔百胜","曹猛","蓝秦","王仲萍","张飞雄","慕容景岳","姜铁山","薛鹊","王铁匠","姜小铁","田青文","张管家","聂钺","上官","褚轰","汪铁鹗","周铁鹤","曾铁鸥","秦耐之","姬晓峰","张九","任通武","相国夫人","蔡威","汤沛","无青子","海兰弼","大智禅师","欧阳公政","西灵道人","文醉翁","周隆","郭玉堂","齐伯涛","陈高波","安提督","宗雄","桑飞虹","倪不大","倪不小","常赫志","常伯志","上官铁生","哈赤大师","心砚","石双英","刘之余","童怀道","李廷豹","石万嗔","木文察","陈家洛","无尘道长","德布","李沅芷","余鱼同","司徒雷","谢不当",
                "刘乘风","血刀老祖","言达平","汪啸风","张姓老者","陆天抒","吴坎","沈城","花铁干","狄云","宝象和尚","周圻","空心菜","鱼贩头子","桃红","耿天霜","高管家","教书先生","铁匠","凌退思","凌霜华","菊友","梅念笙","戚芳","戚长发",
                "丁春秋","马夫人","马五德","小翠","于光豪","巴天石","不平道人","邓百川","风波恶","甘宝宝","公冶乾","木婉清","少林老僧","太皇太后","天狼子","天山童姥","王语嫣","乌老大","无崖子","云岛主","云中鹤","止清","白世镜","包不同","本参","本观","本相","本因","出尘子","冯阿三","兰剑","古笃诚","过彦之","平婆婆","石清露","石嫂","司空玄","司马林","玄慈","玄寂","玄苦","玄难","玄生","玄痛","叶二娘","竹剑","左子穆","华赫艮","乔峰","李春来","李傀儡","李秋水","刘竹庄","朴者和尚","祁六三","全冠清","阮星竹","西夏宫女","许卓诚","朱丹臣","努儿海","阿碧","阿洪","阿胜","阿朱","阿紫","波罗星","陈孤雁","鸠摩智","来福儿","孟师叔","宋长老","苏星河","苏辙","完颜阿古打","耶律洪基","耶律莫哥","耶律涅鲁古","耶律重元","吴长风","吴光胜","吴领军","辛双清","严妈妈","余婆婆","岳老三","张全祥","单伯山","单季山","单叔山","单小山","单正","段延庆","段誉","段正淳","段正明","范禹","范百龄","范骅","苟读","和里布","何望海","易大彪","郁光标","卓不凡","宗赞王子","哈大霸","姜师叔","枯荣长老","梦姑","姚伯当","神山上人","神音","狮鼻子","室里","项长老","幽草","赵钱孙","赵洵","哲罗星","钟灵","钟万仇","高升泰","龚光杰","贾老者","康广陵","秦红棉",
                "容子矩","桑土公","唐光雄","奚长老","徐长老","诸保昆","崔百泉","崔绿华","符敏仪","黄眉和尚","菊剑","聋哑婆婆","梅剑","萧远山","游骥","游驹","游坦之","程青霜","傅思归","葛光佩","缘根","智光大师","鲍千灵","褚万里","瑞婆婆","端木元","黎夫人","薛慕华","慕容博","慕容复","谭公","谭婆","谭青","摘星子","慧方","慧观","慧净","慧真","穆贵妃",
                "一灯大师","马青雄","马钰","小沙弥","木华黎","丘处机","沈青刚","书记","书生","天竺僧人","王处一","王罕","尹志平","包惜弱","冯衡","术赤","农夫","孙不二","札木合","华筝","李萍","刘玄处","刘瑛姑","吕文德","乔寨主","曲三","曲傻姑","全金发","汤祖德","朱聪","陈玄风","赤老温","瘦丐","陆乘风","陆冠英","沙通天","吴青烈","杨康","杨铁心","余兆兴","张阿生","张十五","忽都虎","欧阳峰","欧阳克","梅超风","铁木真","拖雷","者勒米","段天德","枯木","周伯通","郭靖","郭啸天","郝大通","洪七公","侯通海","姜文","柯镇恶","南希仁","胖妇人","胖丐","胖子","哑梢公","都史","钱青健","桑昆","盖运聪","黄蓉","黄药师","梁长老","梁子翁","渔人","博尔忽","博尔术","程瑶迦","韩宝驹","韩小莹","焦木和尚","鲁有脚","穆念慈","彭长老","彭连虎","童子","窝阔台","简长老","简管家","裘千仞","裘千丈","察合台","酸儒文人","谭处端","黎生","樵子","灵智上人","完颜洪烈",
                "卫周祚","马喇","马佑","马宝","马博仁","马超兴","毛文珠","小桂子","小玄子(玄烨)","马齐","心溪","韦小宝","韦春花","皇甫阁","巴颜法师","巴泰","方怡","风际中","邓炳春","云素梅","无根道人","王潭","方大洪","五符","元义方","巴郎星","王武通","王进宝","王琪","双儿","史松","华伯斯基","于八","冯难敌","邝天雄","平威","白寒松","白寒枫","卢一峰","归辛树","玄真道人","司徒鹤","司徒伯雷","对喀纳","冯锡范","孙思克","归钟","归二娘","玉林","汤若望","李自成","老吴","守备","米思翰","江百胜","齐元凯","齐洛诺夫","刘一舟","沐剑声","庄夫人","许雪亭","多隆","行痴","祁清彪","关安基","吕留良","陈珂","李西华","吕葆中","吕毅中","行颠","庄廷龙","庄允城","陆高轩","杜立德","吴之荣","苏菲亚","陈圆圆","罕贴摩","吴大鹏","沐剑屏","吴三桂","阿济赤","阿尔尼","张淡月","苏荃","苏冈","吴六奇","李式开","李力世","陈近南","吴应熊","杨溢之","佟国纲","吴立身","张康年","张勇","张妈","吴宝宇","何惕守","劳太监","明珠","柳燕","图海道","杰书","郎师傅","图尔布青","净清","净济","林兴珠","林永超","柳大洪","呼巴音","昌齐","郑克爽","赵齐贤","建宁公主","茅十八","神照上人","洪朝","姚春","施琅","费要多罗","胡逸之","南怀仁","钟志灵","洪安通","胡德第","姚必达","赵良栋","查继左","胖头陀","郝太监","徐天川","陶红英","索额图","教士","陶师傅","高里津","敖彪","高颜超","钱老本","海大富","殷锦","贾老六","笔贴式","顾炎武","夏国相","桑结","晦聪禅师","章老三","黄甫","黄金魁","崔瞎子","黄宗羲","菊芳","彭参将","葛尔丹","程维藩","温有方","温有道","舒化龙","曾柔","富春","葛通","路副将","雷一啸","瘦头陀","蕊初","瑞栋","蔡德忠","察尔珠","潘先生","澄光","澄通","澄观","澄心","澄识","樊纲","慕天颜","鳌拜",
                "丁坚","丁勉","上官云","万大平","于人豪","于嫂","不戒和尚","长青子","仇松年","丹青生","邓八公","方人智","方生","方证","风清扬","计无施","天门道人","天松道人","天乙道人","王伯奋","王诚","王二叔","王夫人","王家驹","王家骏","王元霸","王仲强","白二","白熊","丛不弃","莫大","农妇","东方不败","乐厚","令狐冲","宁中则","平夫人","平一指","申人俊","史镖头","史登达","司马大","田伯光","仪和","仪琳","仪清","玉玑子","玉灵道人","玉磬子","玉音子","玉钟子","左冷禅","成不忧","成高道人","冲虚道长","吉人通","老不死","老头子","刘菁","刘芹","刘正风","米为义","齐堂主","曲非烟","曲洋","任我行","英颚","西宝","向大年","向问天","陈七","陈歪嘴","迟百诚","狄镖头","狄修","定静师太","杜长老","何三七","季镖头","劳德诺","陆伯","陆大有","任盈盈","沙天江","秃笔翁","吴柏英","吴天德","辛国梁","严三星","杨莲亭","余沧海","余人彦","岳灵珊","张夫人","张金鏊","定逸","建除","林平之","林远图","林震南","罗人杰","易国梓","易师爷","易堂主","英白罗","英长老","岳不群","郑镖头","郑萼","周孤桐","封不平","洪人雄","侯人英","觉月","施戴子","施令威","闻先生","哑婆婆","钟镇","祝镖头","祖千秋","高克新","高明根","贾布","麻衣汉子","费彬","秦娟","秦伟帮","舒奇","桑三娘","桃干仙","桃根仙","桃花仙","桃实仙","桃叶仙","桃枝仙","陶钧","夏老拳师","崔镖头","黄伯流","黄国柏","黄钟公","假东方不败","绿竹翁","清虚道人","游迅","葛长老","黑白子","黑熊","鲁连荣","童百熊","鲍大楚","解风","蓝凤凰","谭迪人","震山子","木高峰","贾人达",
                "卫春华","马善均","于万亭","大癫","马敬侠","大苦","马真","孙大善","万庆澜","马大挺","上官毅山","文泰来","心砚","天镜","木卓伦","元伤","元痛","元悲","方有德","王维扬","王道","贝人龙","尹章垓","天虹禅师","冯辉","石双英","玉如意","平旺先","龙骏","白振","孙老三","孙克通","安健刚","成璜","兆惠","关明梅","李可秀","朱祖荫","李沅芷","吴国栋","迟玄","沈德潜","杨成协","余鱼同","陈家洛","张安官","纳斯尔丁·阿凡提","玛米尔","陆菲青","孟健雄","陈正德","宋善朋","张召重","言伯乾","汪浩天","阿凡提妻","阿里","宋天保","和?brvbar;","武铭","凯别兴","郑板桥","忽伦大虎","周绮","忽伦二虎","忽伦三虎","忽伦四虎","周阿三","范中恩","和尔大","罗信","周仲英","呼音克","周大奶奶","周英杰","赵半山","哈合台","皇太后","骆冰","胡老爷","唐六爷","阎世章","阎世魁","徐天宏","袁枚","顾金标","桑拉巴","袁士霄","教长","钱正伦","梅良鸣","曹司朋","章进","曹能","常伯志","常赫志","乾隆皇帝","韩春霖","蒋天寿","瑞芳","晴画","焦文期","蒋四根","蒋士铨","褚圆","曾图南","喀丝丽","童兆和","韩文冲","覃天丞","彭三春","德鄂","腾一雷","瑞大林","福康安","霍青桐","霍阿伊","戴永明",
                "丁大全","人厨子","九死生","马钰","小棒头","大头鬼","马光佐","小王将军","小龙女","尹志平","丘处机","王处一","王十三","公孙止","少妇","王志坦","王惟忠","无常鬼","尹克西","天竺僧","公孙绿萼","孙婆婆","孙不二","皮清云","申志凡","冯默风","讨债鬼","史伯威","史仲猛","史叔刚","史季强","史孟龙","圣因师太","尼摩星","李莫愁","达尔巴","刘处玄","朱子柳","曲傻姑","吕文德","祁志诚","李志常","刘瑛姑","吊死鬼","百草仙","陆鼎立","陆二娘","阿根","张志光","完颜萍","陆冠英","宋德方","陈大方","宋五","沙通天","灵智上人","郭靖","郭芙","郭襄","霍都","张君宝","张一氓","陈老丐","张二叔","陆无双","杨过","武三通","武敦儒","武修文","武三娘","林朝英","耶律晋","耶律楚材","耶律燕","忽必烈","丧门鬼","俏鬼","蒙哥","狗头陀","青灵子","欧阳峰","耶律齐","金轮法王","周伯通","洪凌波","点苍渔隐","柔儿","郭破虏","侯通海","觉远大师","柯镇恶","赵志敬","洪七公","姬清玄","笑脸鬼","鹿清笃","崔志方","鄂尔多","萨多","黄药师","黄蓉","程遥迦","鲁有脚","彭连虎","韩无垢","童大海","韩老丐","彭长老","蓝天和一灯大师瘦丐","程瑛","雷猛","裘千尺","煞神鬼","催命鬼","裘千仞","赫大通","潇湘子","樊一翁","藏边大丑","藏边二丑","藏边三丑","藏边四丑",
                "小菊","万里风","水鉴","义生","马公子","玉真子","水云道人","王师兄","木桑道长","归辛树","归二娘","孙仲寿","田见秀","龙德邻","孙仲尹","冯同知","宁完我","石骏","史秉文","史秉光","冯难敌","冯不摧","冯不破","白脸人","安大娘","刘芳亮","吕七","杨景亭","刘培生","安剑清","多尔衮","刘宗敏","红娘子","朱安国","老王","安小慧","齐云","张朝唐","张信","张康","杨鹏举","张春九","沙老大","闵子华","吴平","沙广天","孟伯飞","孟铸","张若谷","孟铮","李岩","单铁生","陈圆圆","宋献策","应松","岑其斯","何红药","李自成","阿九","何铁手","郑起云","范文程","罗大千","罗立如","彼得","若克琳","荣彩","洞玄","侯飞文","皇太极","祖大寿","倪浩","哑巴","胡桂南","胡老三","洪胜海","秦栋","钱通四","高师弟","袁承志","夏雪宜","崔秋山","黄真","崔希敏","黄二毛子","曹化淳","黄须人","梅剑和","温正","温南扬","焦公礼","程青竹","褚红柏","董开山","温方施","温方山","温方悟","温青","温方达","温方义","焦宛儿","温仪","鲍承先","谭文理","黎刚","潘秀达",
                "刘於义","杨夫人","花剑影","林玉龙","周威信","卓天雄","逍遥子","袁夫人","袁冠南","常长风","盖一鸣","萧半和","萧中慧(即杨中慧)"
                };

        int surNameLen = surName.length;
        int doubleSurNameLen = doubleSurName.length;
        int wordLen = word.length;

        StringBuffer sb = new StringBuffer();
        Random random = new Random();
       /* if(simple){
            sb.append(surName[random.nextInt(surNameLen)]);
            int surLen = sb.toString().length();
            for (int i = 0; i < len - surLen; i++) {
                if(sb.toString().length() <= len){
                    sb.append(word[random.nextInt(wordLen)]);
                }
            }
        }else{
            sb.append(doubleSurName[random.nextInt(doubleSurNameLen)]);
            int doubleSurLen = sb.toString().length();
            for (int i = 0; i < len - doubleSurLen; i++) {
                if(sb.toString().length() <= len){
                    sb.append(word[random.nextInt(wordLen)]);
                }
            }
        }*/
        sb.append(wordTree[random.nextInt(wordTree.length)]);
        return sb.toString();
    }

    public static void main(String[] args){
        System.out.println(randomName(true,3));
    }

}
